<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"137bae7b785a40cd474126c687dcbf28913a1101f3a3f6e5950316ee17143a33","plan_job_ref":"Job Test plan target and replace #382 at https://github.com/dflook/terraform-github-actions/actions/runs/7277293788","plan_hash":"ecae4dd0577c8cea1e7b816030855c287be88927c029ecc738a75ed884feaab8","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "PxOwna7Jq8" -> (known after apply)
!~  foreach = "BqUqEYwX9J" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #382](https://github.com/dflook/terraform-github-actions/actions/runs/7277293788)